---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarBarType.Create(Autodesk.Revit.DB.Document)
zh: 创建、新建、生成、建立、新增
source: html/87e9896d-863b-22e0-482c-92e032d42144.htm
---
# Autodesk.Revit.DB.Structure.RebarBarType.Create Method

**中文**: 创建、新建、生成、建立、新增

Creates a new RebarBarType object

## Syntax (C#)
```csharp
public static RebarBarType Create(
	Document ADoc
)
```

## Parameters
- **ADoc** (`Autodesk.Revit.DB.Document`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null